[Killed] ConditionalExpression
controllers/PracticePlan.js:82:32
         } 
         // If practice day                    
         else{
-            for(let i = start; i <= end; i++) {                  
+            for(let i = start; false; i++) {                  
                 Days.push({ 
                     Day: i, 
killedBy: buildPracticePlan should build practice plan for 60 days and target level 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"CompletedQuestion": 0, "Day": 1, "NumberofQuestions": 60}
Received: undefined
